var start_block_html = `
<section id="scrool_to"></section>
`

var main_html = `
<section id='war'>
<h2 style="color: #FFE4B5;"> Гражданская война на Дону</h2>
<p>
  После Октябрьского переворота Российское общество окончательно раскололось. Проигранная война, резкое и жесткое уничтожение старых порядков, всё это не могло не вызывать гнев и реакцию в офицерской среде. Такая реакция действительно возникла, причём она затрагивала не только монархически настроенных армейских элементов(Врангель, Краснов), но даже и тех кто воспринял завоевания “февраля” положительно(Деникин). Изначально коммунистическая агитация действовала в городской части страны, ну или там где количество пролетариата было высоко, крестьяне подключились позже, что определило места концентрации белых сил.
  Ситуация на дону в свою очередь была особенной. Если в большей части Империи дворяне уже постепенно избавлялись от феодальных предрассудков, то на Дону главенствующим сословием осталось казачество.
  Казаки ревностно относились к своим земельным привилегиям, но всегда были достаточно аполитичным сословием. Это в свою очередь определило их политический нейтралитет в начале ГВ. Однако как только Большевики начали передел земли и установление своих порядков(Донская Советская республика). Казаки стали восставать. Сначала они примкнули к ВВД(Всевеликое войско донское) под командованием Краснова. И только позже после создания ДА(Добровольческой армии), они примыкают к Белому движению. Южный фронт гражданской войны можно назвать самым главным. Причём в Южный фронт стоит включать ещё и Кавказ, ведь там концентрация полезных ресурсов(добываемых или легко добываемых) была крайне высокой, а следовательно и интерес к региону был высок. В свою очередь В Сибири белое движение было достаточно плохо организованно. Даже когда Колчак консолидировал власть, всё равно в Сибири было кипело слишком много сил, причем это были даже не чисто антибольшевистские силы, но и например “Антоновцы”(Тамбовские повстанцы), чехо-словацкий корпус. Это сильно ослабляло восток России. Окончательно судьба востока решилась, когда ВСЮР отказался пробиваться навстречу адмиралу.
  Юг России остался самым мощным и единым образованием белого движение. Это определило степень ожесточенности гражданской  войны на Дону. Несмотря на то что военные преступления совершали все(только Фрунзе и Дроздовский не отметились подобным), на Дону их концентрация была достаточно высокой и исходила в основном от Казаков. Силы Юга были достаточно мощны, но не многочисленны(конкретно резервов было меньше чем у красных), также многие солдаты уже давно воевали(первая мировая ещё идёт), и их боевой дух был не на самом высоком уровне. Красным явно не хватало опыта и дисциплины, но это проблема уже к 1919 году практически решилась, резервов и боевого духа большевикам хватало в избытке, и благодаря тому, что РСФСР находилась на промышленно развитых территориях то и оружия с амуницией хватало. Собственно до московского похода 1919 ВСЮР действовал достаточно успешно, и только после Орловской катастрофы, положение белых стала крайне угрожающей. Деникину мог помочь Пилсудский, но он отказался помогать наследникам империи. В 1920 Деникин отправился в отставку, и его место занял энергичный и решительный Врангель, его энергия передалась и солдатам, но ресурсы ВСЮР уже иссякли, и несколько побед на юге кубани, сменились поражениями, и осенью 1920 года Врангель начал эвакуацию белого движения из Крыма. Все Белые формирования были разбиты по частям. У Колчака был недостаток в снаряжении и солдатах, а у ВСЮР были реальные шансы на успех, на юге не было недостатка в солдатах и толковых офицерах, но политиков там было откровенно мало, и договориться ни с Антантой, ни с Поляками, ни даже с другими белыми лидерами ВСЮР не удалось.
</p>
</section>
</section>
    <section id='book'>
      <h2 style="color: #FFE4B5;"> О прототипе в романе Тихий Дон</h2>
      <div class='general_div'>
        <div class='general_photo'>
            <img align='right' id='general_photo' src='./assets/img/prototype.png'>
        </div>
        <div class='general_text'>
          <p>Прототипом Григория Мелехова многими историками и литературоведами признаётся Харлампий Васильевич Ермаков. Это казак, родился в 1891 на севере современной Ростовской области. Как любой казак был обязан служить. Поступил на службу в 1913, во время Первой мировой в Галиции, а затем на румынский фронт. Отличался большой храбростью 4-жды был награждён георгиевскими крестами и медалями. В 1916 был ранен и фактически в 1917 был демобилизован.  В 1917 воевал за революцию, но 
            После начала антибольшевистского восстания перешел на сторону казаков, воевал под Царицыным в составе Донской армии. В 1919 году вновь вернулся на сторону красных. Был в почете у маршала Будённого. В 1923 бессрочно демобилизован. Пытались расстрелять как чллена анти-большевиского востания, но был оправдан по свидетельским показаниям. Однако в 1927 году вновь был арестован. По ложным показаниям расстрелян,  в 1989 посмертно реабилитирован.</p>
        </div>
      </div>
    </section>

<section id='actions_section'>
<h2> События</h2>
<h3>I. Начальный этап</h3>
<p>Ноябрь – декабрь 1917 г. формирование протиборствующих сторон. Создание органов Советской власти (военно-революционных комитетов) при одновременном усилении антисоветских сил.</p>
<p>Декабрь 1917 г. – февраль 1918 г. противостояние войск Советской России и антисоветских сил. Первое установление Советской власти на Дону.</p>
<p>Апрель 1918 г. – восстание казаков. Свержение Советской власти на Дону.</p>
<h3>II. Казацкое сопротивление</h3>
<p>Май 1918 г. – февраль 1919 г. – Образование Всевеликого войска Донского во главе с атаманом Красновым. Походы донского казачества на Воронеж и Царицын</p>
<p>Февраль – март 1919 г. – Поражение войск Краснова. Повторное восстановление Советской власти. Проведение на Дону политики «Расказачивания».</p>
<p>Март – июнь 1919 г. – «Верхневешенское восстание» казаков против Советской власти.</p>
<h3>III. Подход регулярных сил Деникина(ВСЮР) и заключительная фаза</h3>
<p>Июнь 1919 г. – февраль 1920 г. – Вступление в Донскую область Вооруженных сил юга России во главе с А.И. Деникиным. Объединение сил казаков и белой армии против Советской власти.</p>
<p>Февраль 1920 г. – Разгром армии Деникина войсками Красной Армии. Окончательное восстановление Советской власти на Дону.</p>
<a id="actions_href" class="section_button">Перейти на страницу с событиями</a>
</section>

<section id='generals_section'>
<h2> Генералы</h2>
<a id="generals_href" class="section_button">Перейти на страницу с генералами</a>
</section>
`
var info_html = `
<section id='about_us'>
    <h2> О сайте</h2>
    <p>Не очень много текста о сайте...</p>
    <p>Не очень много текста о сайте...</p>
    <p>Не очень много текста о сайте...</p>
</section>
<section id='copyrights'>
    <h2>Источники</h2>
    <h3>Тексты</h3>
    <p>РВИО:  Официальный сайт .- Москва - URL :  http://100.histrf.ru/commanders/frunze-mikhail-vasilevich (дата обращения 12.02.2022)</p>
    <p>РВИО:  Официальный сайт .- Москва - URL : http://100.histrf.ru/commanders/denikin-anton-ivanovich (дата обращения 12.01.2022)</p>
    <p>РВИО:  Официальный сайт .- Москва - URL : http://100.histrf.ru/commanders/vrangel-petr-nikolaevich (дата обращения 21.12.2021)</p>
    <p>Министерство обороны РФ: Официальный сайт .- Москва - URL : https://encyclopedia.mil.ru/encyclopedia/history/more.htm?id=11862485 (дата обращения 20.12.2021)</p>
    <p>Венков А. В. С Харлампием Ермаковым не всё так просто // Донской временник. Год 2009-й / Дон. гос. публ. б-ка. Ростов-на-Дону, 2008. Вып. 18. С. 190-193. URL: http://donvrem.dspl.ru/Files/article/m5/4/art.aspx?art_id=1017 (дата обращения 04.12.2021)</p>
    <p>БРЭ : Официальный сайт .- Москва - URL : https://bigenc.ru/military_science/text/1911482 (дата обращения 09.02.2022)</p>
    <p>ЭНЦИКЛОПЕДИЯ Волгоградской области : Официальный сайт .- URL : http://nlr.ru/res/epubl/rue/texts/volgograd/RUS/enciklopediya/1/O.html#4 (дата обращения 01.01.2022)</p>
    <p>Демешина Е.И., Хмелевский К.А.      :  История донского края. /Учебное пособие для учащихся 9 - 10-х классов средней школы' - Ростов-на-Дону: Ростовское книжное издательство, 1983</p>
    <h3>Изображения</h3>
    <p>Фон 1 - https://cdnb.artstation.com/p/assets/images/images/020/690/295/large/pasha-shimanski-.jpg?1568786045</p>
    <p>Фон 2 - https://muzey-tihoreck.ru/images/phocagallery/2021/2021-05-25/16.jpg</p>
</section>
`

var generals_html = `
<section>
<h2 style="text-align: center">Белые Генералы<h2>
</section>
<section>
    <h3 style="color: #eeeeee91"> Главнокомандующие</h3>
    <h2 style='color: #FFE4B5;'> Антон Иванович Деникин</h2>
    <div class='general_div'>
        <div class='general_photo'>
            <img align='right' id='general_photo' src='./assets/img/generals/Denikin.jpg'>
        </div>
        <div class='general_text'>
            <p>Родился в 1872 под Варшавой, в семье разночинцев(что отличало его от других членов высшего командного состава белой армии). В 1892 поступил в Киевское пехотное юнкерское училище получил звание лейтенанта. До Р-Я войны служил в разных частях штабным офицером. Во время Р-Я войны воевал в Маньчжурии, дослужился до звания полковника. В 1914 году в звании Генерал-лейтенанта принял командования “Железной дивизии”. Действовал крайне удачно. В 1916 году спасал Румынию от разгрома. Революцию 1917 года поддержал, однако был разочарован новыми властями России, после провала заговора Корнилова был арестова, но смог бежать во время октябрьской революции, и примкнул к Корнилову, после его смерти возглавил добровольческую армию. В 1919 году добровольческая армия Корнилова и Донские силы объединились в ВСЮР. Благодаря его(и других белых генералов) умелому командованию удалось добиться максимального приближения к Москве. Однако несмотря на военную гениальность, он не сумел удержать тыл стабильным, что привело к разгрому интендантства и отступление назад к Дону. Разлагающаяся армия, популярность Деникина, а также провал эвакуации из Новороссийска, привели к тому, что Деникин передал ВСЮР Врангелю, а сам Эмигрировал в Англию. Помогал эмигрантам, и один из немногих деятелей белого движения, кто наотрез отказался помогать нацистам, во времена ВОВ.</p>
        </div>
    </div>
    <h2 style='color: #FFE4B5;'> Врангель Пётр Николаевич</h2>
    <div class='general_div'>
        <div class='general_photo'>
            <img align='right' id='general_photo' src='https://upload.wikimedia.org/wikipedia/commons/e/e3/Pyotr_Wrangel%2C_portrait_medium.jpg'>
        </div>
        <div class='general_text'>
            <p>Родился 1878 в знатном и старинном прибалтийском дворянском роде, ведущим свою историю с XIII века. В 1901 году был призван в РИА в Гвардейский конный полк. В 1902 получил офицерский чин, однако его поведение оставляло желать лучшего, так что он был вынужден оставить службу. В 1905 году с началом русско-японской добровольно поступил на службу, теперь в казачий полк Маньчжурской армии. Воевал храбро и умело, что определило его служебный рост. Во время 1-ой революции оставался верен короне за что был вознагражден благосклонностью Императора. 
            В 1913 Стал командующим эскадрона Его Величества.К 1917 уже был Генерал-майором, крайне отрицательно отнесся к Февральской революции.Пытался выступить против республиканской власти, однако восстание Корнилова провалилось. После “октября” спасся от революционных властей и в 1918 году прибыл в Екатеринодар к Деникину. Был крайне активным и грамотным командиром, его успехи на Кубани принесли ему звание генерал-лейтенанта, а самое главное ,что он вдохновил Деникина на московский поход, однако после его провала их отношения испортились. Неоднородность белого движения было на руку Врангелю, в 1920 году недовольство Деникиным достигло предела, и Врангель возглавил ВСЮР. Однако он лишь отсрочил начало конца белого движения. После эвакуации из крыма активно помогал деятельности РОВС.</p>
        </div>
    </div>
</section>
<section>
    <h3 style="color: #eeeeee91"> Другие Генералы</h3>
    <div class='short_general_div'>
        <div class='short_general_photo'>
            <img align='right' id='short_general_photo' src='./assets/img/generals/PolcovnikDrozdovskiy.jpg'>
        </div>
        <div class='short_general_text'>
            <h3 style='text-align: right; padding-bottom: 2%'>Дроздовский Михаил Гордеевич</h3>
        </div>
    </div>
    <div class='short_general_div'>
        <div class='short_general_photo'>
            <img align='right' id='short_general_photo' src='./assets/img/generals/Bogaevsky.jpg'>
        </div>
        <div class='short_general_text'>
            <h3 style='text-align: right; padding-bottom: 2%'>Богаевский Африкан Петрович</h3>
        </div>
    </div>
    <div class='short_general_div'>
        <div class='short_general_photo'>
            <img align='right' id='short_general_photo' src='./assets/img/generals/Markov.jpg'>
        </div>
        <div class='short_general_text'>
            <h3 style='text-align: right; padding-bottom: 2%'>Марков Сергей Леонидович</h3>
        </div>
    </div>
    <div class='short_general_div'>
        <div class='short_general_photo'>
            <img align='right' id='short_general_photo' src='./assets/img/generals/Krasnov.jpg'>
        </div>
        <div class='short_general_text'>
            <h3 style='text-align: right; padding-bottom: 2%'>Краснов Пётр Николаевич</h3>
        </div>
    </div>
</section>
<section>
<h2 style="text-align: center">Красные Генералы<h2>
</section>
<section>
    <h3 style="color: #eeeeee91"> Главнокомандующие</h3>
    <h2 style='color: #FFE4B5;'> Егоров Александр Ильич</h2>
    <div class='general_div'>
        <div class='general_photo'>
            <img align='right' id='general_photo' src='./assets/img/generals/Egorov.jpg'>
        </div>
        <div class='general_text'>
            <p>Родился 1883 близ Самары в Бузулуке. Добровольно вступил в РИА. Во время первой мировой уже имел звание капитана, был несколько раз ранен. к 1917 имел звание подполковника, в те годы(и ранее с 1903) был эссером в 1917 вступил в партию официально. В 1918 был одним из создателей РККА.
            В 1919 году по командовал 10 и 14 армиями на южном фронте гражданской войны, эти соединения были необученными не регулярными частями. Не смотря на весьма скромные успехи он обладал отличными тактическими способностями, что было ценно при большой нехватки профессионалов в РККА.С октября 1919-январь 1920 занимал пост командующего всем Южным фронтом, в 1920 году когда поражение белого движение уже было неизбежно его отправили на Советско-Польскую войну.
            В 1935 становиться Маршалом СССР
            В 1938 Оговорил себя и был осуждён за шпионаж в пользу польши и заговору, был расстрелян
            в 1956 реабилитирован.
            </p>
        </div>
    </div>
    <h2 style='color: #FFE4B5;'> Фрунзе Михаил Васильевич</h2>
    <div class='general_div'>
        <div class='general_photo'>
            <img align='right' id='general_photo' src='./assets/img/generals/Frunze.jpg'>
        </div>
        <div class='general_text'>
            <p>Родился в 1885 году в Бишкеке. Был отличным учеником, поступил в столичный университет на экономиста. В институте и сложились его революционные левые взгляды.В 1904 вступил в РСДРП.Во время революции 1905 активно участвовал в свержении самодержавия, был ранен во время“Кровавого воскресенья”. Участвовал в вооруженном восстании в Москве на Пресне. На IV съезде РСДРП познакомился с В.И.Лениным.Участвовал и в террористической деятельности. В 1907 году был приговорён к смертной казни, однако приговор был смягчён, и его отправили на каторгу. В 1916 году сбежал, и добрался до европейской части России. Там он попал на фронт, активно агитировал солдат. В 1917 активно участвовал в революции, и руководил Минской ячейкой РСДРП. После октября Фрунзе стал активным строителем нового советского гос-ва.Он не имел профессионального военного образования, однако компенсировал это собрав вокруг себя целую плеяду военспецов. Также крайне активно изучал военную литературу. В 1919 успешно разгромил Колчака и выбил его в Сибирь, также очистил Среднюю азию. В 1920 Году Положение ВСЮР в Крыму было пиковым, а Егоров был нужен для противостояния полякам, его должность занял Фрунзе. Он успешно разбил и Врангеля. 
            В 1925 стал главой советской армии, проводил военную реформу.М.В.Фрунзе умер 31 октября 1925. Он был одним из самых талантливых и не жестоким военачальников РККА, держался в стороне от партийной борьбы.
            </p>
        </div>
    </div>
</section>
<section>
    <h3 style="color: #eeeeee91"> Другие Генералы</h3>
    <div class='short_general_div'>
        <div class='short_general_photo'>
            <img align='right' id='short_general_photo' src='./assets/img/generals/Mironov-Filipp-Kuzmich.jpg'>
        </div>
        <div class='short_general_text'>
            <h3 style='text-align: right; padding-bottom: 2%'>Миронов Филипп Кузьмич</h3>
        </div>
    </div>
    <div class='short_general_div'>
        <div class='short_general_photo'>
            <img align='right' id='short_general_photo' src='./assets/img/generals/Kamenev.jpg'>
        </div>
        <div class='short_general_text'>
            <h3 style='text-align: right; padding-bottom: 2%'>Каменев Сергей Сергеевич</h3>
        </div>
    </div>
    <div class='short_general_div'>
        <div class='short_general_photo'>
            <img align='right' id='short_general_photo' src='./assets/img/generals/Budeniy.jpg'>
        </div>
        <div class='short_general_text'>
            <h3 style='text-align: right; padding-bottom: 2%'>Будённый Семён Михайлович</h3>
        </div>
    </div>
    </div>
</section>
`
var actions_html = `
<section class="action_section">
    <h2 style='text-align: center'> Бои за установление Советской власти на Дону</h2>
    <div class='action_div'>
        <div class='history_action'>
            <h4 style="color: #eeeeee91; padding-bottom: 2%; text-align: center; margin-top: -3%;"> В истории</h4>
            <p>Бои за установление советской власти на Дону
            Осенью 1917 года на Дону начались антиправительственные выступления рабочего класса. Они только усиливались в течении всего Октября 1917 года. Реакционные силы возглавил атаман Каледин. 2 Декабря он успешно захватил Ростов и готовился к походу на Москву. Однако Советская власть среагировала достаточно быстро и уже в конце декабря красная армия сломила Каледенское сопротивление в Ростове. Также в тылу мятежников активно действовали советские агитаторы, казаки достаточно хорошо восприняли социалистические идеи и постепенно переставали сражаться. 17 января 1918 после начала восстания был освобождён Таганрог. Казаки отступили на Кубань. 29 января Каледин застрелился, тем самым окончательно решился вопрос о судьбе казаков. В тот же день был взят Ростов. 30 января был освобождён Новочеркасск. Калединщина была окончательно уничтожена. 
            Революционные Казаки доказали свою реальную силу и храбрость(во многом именно эти части позднее сформировали легендарную 1-ую конную армию) , на Дону были расформированы все органы старой власти, и активно внедрялись советские декреты, проведена национализация земли и предприятий. Фактически Казаков в их классическом виде больше не существовать не будет, ведь ни земли, ни привилегии у них больше нет.</p>
        </div>
        <div class='map_action'>
            <img class="action_map" src="./assets/img/action1_1_map.jpg">
        </div>
        <div class='literature_action'>
            <h4 style="color: #eeeeee91; padding-bottom: 2%; text-align: center; margin-top: -3%;"> В романе</h4>
            <h3>Кн.4, Часть 7, глава I</h3>
            <p>Части Донревкома отхлынули и наводнили Глубокую. Командование всеми силами по существу перешло к Голубову. Он в течение неполных двух дней скомпоновал раздерганные части, принял надлежащие меры к закреплению за собой Глубокой. Мелехов Григорий командовал, по настоянию его, дивизионом из двух сотен 2-го запасного полка и одной сотни атаманцев.
            Успех явно клонился на сторону советских войск. С трех сторон замыкали они Добровольческую армию и остатки калединских «лоскутных» отрядов. 28 января Корнилов прислал Каледину телеграмму, извещавшую о том, что Добровольческая армия покидает Ростов и уходит на Кубань. 29-го, в девять часов утра, в атаманском дворце было созвано экстренное совещание членов донского правительства. Каледин пришел из своей квартиры позже всех. Он тяжело присел к столу, подвинул к себе бумаги. Верхушки щек его пожелтели от бессонницы, под выцветшими угрюмыми глазами лежали синие тени; словно тлен тронул и изжелтил его похудевшее лицо. Медленно прочитал он телеграмму Корнилова, сводки от командиров частей, противостоявших на севере от Новочеркасска натиску красногвардейцев</p>
        </div>
    </div>
</section>
<section class="action_section">
    <h2 style='text-align: center'> Царицин</h2>
    <div class='action_div'>
        <div class='history_action'>
            <h4 style="color: #eeeeee91; padding-bottom: 2%; text-align: center; margin-top: -3%;"> В истории</h4>
            <p>Переломный период (апрель 1918 - февраль 1919)+ оборона Царицына
            Несмотря на разгром Каледина Белые силы на Юге России не собирались сдаваться, оставшиеся казачьи силы консолидировались под командованием Краснова. К тому моменту уже окончательно оформилась Добровольческая армия Деникина. С которыми у Краснова было достаточно плодотворное сотрудничество. Еще более плодотворное сотрудничество Краснов развил с немцами. Именно они оказывали ему активную поддержку.( по оценкам историков немцы поставили Краснову 11.000 винтовок, 46 арт. орудий, 80+ пулеметов, 160.000 снарядов и около 11.000.000 патронов). 1 мая Краснов взял Таганрог, 8 мая пал Ростов.
            В августе 1918 начались сражения за Царицын. Первый штурм окончился ничем, но Царицын был переведен на осадное положение, была проведена мобилизация. В сентябре начался второй приступ города. Но он также был не самым успешным.  На волне успеха красной армии Сталин(командующий обороной) был отозван в Москву. Третий приступ начался в январе 1919 года. Но и третий штурм провалился. После такого разгрома Краснова отозвали из армии. Бои за город продолжались теперь казакам помогали части армии Врангеля, этот штурм уже стал успешным, 30 июня 1919 Царицын был взят. Но для белых война уже была практически проиграна, и надолго город за белыми не остался, 3 января 1920 после приступа красной армии город был освобожден.
            После Ноября 1918 помощь от немцев полностью прекратилась, но за место интервентов немецких, пришли интервенты английские, которые также очень активно снабжают белых. Деникин в 1919 наступал на Москву, и кроме боев за Царицын на южном фронте было относительно спокойно</p>
        </div>
        <div class='map_action'>
            <img class="action_map" src="./assets/img/csaritsin_map.jpg">
        </div>
        <div class='literature_action'>
            <h4 style="color: #eeeeee91; padding-bottom: 2%; text-align: center; margin-top: -3%;"> В романе</h4>
            <h3>Книга 3, часть 6, Глава I.</h3>
            <p>Неподалеку от станицы Дурновской Вешенский полк в первый раз ввязался в бой с отступавшими частями красноармейцев.
            Сотня под командой Григория Мелехова к полудню заняла небольшой, одичало заросший левадами хутор. Час спустя, когда подошли две остальные конные сотни полка, выступили. Разъезды доносили, что красные, силой приблизительно в тысячу штыков, идут им навстречу. Сотни вешенцев потеряли связь с шедшим справа 33-м Еланско-Букановским полком, но все же решили дать бой. Перевалив через бугор, спешились. Коноводы свели лошадей в просторный, ниспадавший к хутору лог. Где-то правее сшиблись разведки.
            К вечеру вяло наступавшие красноармейские части сменил только что прибывший на фронт отряд матросов. Они пошли в атаку на пулеметы в лоб, не ложась, без крика.
            Григорий стрелял непрерывно. Задымилась накладка. Ствол накалился и обжигал пальцы. Охладив винтовку, Григорий снова вгонял обойму, ловил прижмуренным глазом далекие черные фигурки на мушку.
            Матросы сбили их. Сотни, разобрав лошадей, проскакали хутор, выметнулись на бугор. Григорий оглянулся и безотчетно бросил поводья. С бугра далеко виднелось тоскливое снежное поле с мысами занесенного снегом бурьяна и лиловыми предвечерними тенями, лежавшими по склонам балок. По нему на протяжении версты черной сыпью лежали трупы порезанных пулеметным огнем матросов. Одетые в бушлаты и кожаные куртки, они чернели на снегу, как стая присевших в отлете грачей…
            </p>
        </div>
    </div>
</section>
<section class="action_section">
    <h2 style='text-align: center'> Вешенское восстание</h2>
    <div class='action_div'>
        <div class='history_action'>
            <h4 style="color: #eeeeee91; padding-bottom: 2%; text-align: center; margin-top: -3%;"> В истории</h4>
            <p>Вешенское восстание
            После установления советской власти на Дону, начались коренные преобразования во всех сферах жизни, как и во многих других частях страны, например «декрет о земле», хоть и окончательно добил феодальные пережитки всё еще не мог до конца унифицировать регион, так что в 1919 году советские власти стали активно «расказачивать» население, но кроме очевидных для подобных политик политических чисток(среди казачьей верхушки), расказачивание предусматривало ещё и ликвидацию особенностей местного крестьянства, засчёт переселение крестьян с севера. А так же продразвёрстки (что было стандартом для территорий с плодородными почвами). Естественно такое не могло не расстроить местных крестьян и казаков-средняков(казаки мелкие землевладельцы или безземельцы [они воевали за советскую власть]).
            Восстание началось в марте 1919 года в станицах: Вешенская, Мигулинская, Еланская. Скоро из разрозненных выступлений восстание консолидировалось, его возглавил хонружий(младше унтер-офицерское звание) Кудинов. Восстание насчитывало примерно 25-30 тысяч человек, причём это были именно казаки обладающие хорошим боевым опытом. На подавление восстание красная армия выделила 15.000 человек. Эти силы выделялись с фронта что ослабляло Южний фронт РККА. До конца апреля ни одна из сторон не добилась успеха. Переговоры с восставшими, проводимые в то же время, так же провалились, так как был найден способ снабжать повстанцев по воздуху(ВСЮРом). К концу мая в регион прибыли дополнительные силы РККА  для подавления восстания, в основном именно эти силы оказывали реальное сопротивление, так как войска Южного фронта во многом восставшим симпатизировали. Восставшие активно сопротивлялись и казаки Краснова предприняли попытку прорыва, она была удачной и 24 мая восставшие смогли соединиться с Донской армией, и продолжить борьбу. 
            Вешенское восстание стало одним из самых главных событий 1919 года, ведь именно отвлечение существенных сил РККА с фронта, что  позволило Деникину предпринять ряд военных операций, которые в свою очередь обеспечили  ВСЮР успех на первом этапе Московского похода.</p>
        </div>
        <div class='map_action'>
        <img class="action_map" src="./assets/img/veshenskoye_map.jpg">
        </div>
        <div class='literature_action'>
            <h4 style="color: #eeeeee91; padding-bottom: 2%; text-align: center; margin-top: -3%;"> В романе</h4>
            <h3>Кн.3, Часть 6, глава XXXII</h3>
            <p>... Тридцать пять тысяч повстанцев делились на пять дивизий и шестую по счету отдельную бригаду. ...</p>
            <h3>Кн.3, Часть 6, глава XXXIII</h3>
            <p>... Как только повстанческие сотни вошли в Усть-Хоперскую и окружили митинговавших сердобцев, комбриг 6-й бригады Богатырев с Вороновским и Волковым удалились на совещание. ...</p>
            <h3>Кн.3, Часть 6, глава LII</h3>
            <p>... На секретном совещании верховного командования повстанческими силами решено было просить донское правительство, атамана Богаевского, о помощи ... </p>
            <h3>Кн.3, Часть 6, глава XL</h3>
            <p>... Петр Богатырев остался на Сингином, потом переехал в Вешенскую. ...</p>
            <h3>Кн.3, Часть 6, глава LVII- LXI</h3>
            <p>... Верхнедонское восстание, оттянувшее с Южного фронта значительное количество красных войск, позволило командованию Донской армии не только свободно произвести перегруппировку своих сил на фронте, прикрывавшем Новочеркасск, но и сосредоточить в районе станиц Каменской и Усть-Белокалитвенской мощную ударную группу из наиболее стойких и испытанных полков ... </p>
            <h3>Кн.4, Часть 7, глава I</h3>
            <p>... Части Донревкома отхлынули и наводнили Глубокую. Командование всеми силами по существу перешло к Голубову. Он в течение неполных двух дней скомпоновал раздерганные части, принял надлежащие меры к закреплению за собой Глубокой. ... </p>
        </div>
    </div>
</section>
<section class="action_section">
    <h2 style='text-align: center'> Поход на Москву</h2>
    <div class='action_div'>
        <div class='history_action'>
            <h4 style="color: #eeeeee91; padding-bottom: 2%; text-align: center; margin-top: -3%;"> В истории</h4>
            <p>Деникинский поход на Москву
            В 1919 году у Деникина было 2 варианта того как действовать: либо идти на соединение с Колчаком, либо идти на Москву. От первого плана ВСЮР отказался. Силы белых не были многочисленнее красных а также не могли похвастаться большим количеством ресурсов, Деникин считал, что народ восстанет против большевиков и присоединиться к его армии.  Белая армия была организованнее и профессиональнее, что определило ее успех в первой части похода. В августе 1919 белая армия активно громила красных и продвигалась с Кубани на Украину.
            В октябре Красные потеряли Орёл, а затем и Тулу. Всё это выглядело как поражение в войне, однако Фронт красных не был развален, они несли потери но организованно отступали, также большого притока бойцов в ВСЮР не было, и резервы белых истощались стремительно, в то время как у красных приток добровольцев компенсировал потери. 
            В октябре красные ударили Деникину в тыл и его наступление заглохло.
            Но даже не удар красных стал причиной провала, им стал удар “махновцев”, в тылу войск у Деникина было немного, и подавить восставших, иначе как передовыми частями было невозможно.
            10 Ноября белые практически подавили восстание, но советские командиры почувствовали момент, и ударили.
            Держаться у белых сил уже не было. Недостаток чувствовался и в вооружении, которое уже практически закончилось,белые отступали со стремительной скоростью, в ноябре фронт рухнул, 26 декабря 1919 белые оставили Ростов. Такой провал, уже означал поражение Белого движения на юге России. Деникин подал в отставку, его сменил Врангель, но даже достаточно грамотные действия нового командира не спасли белую Россию…</p>
        </div>
        <div class='map_action'>
        <img class="action_map" src="./assets/img/pohod_denikina_map.jpg">
        </div>
        <div class='literature_action'>
            <h4 style="color: #eeeeee91; padding-bottom: 2%; text-align: center; margin-top: -3%;"> В романе</h4>
            <h3>Кн. 4. Часть. 7. Глава ХХ</h3>
            <p>Однако, как ни велики были успехи Донской армии в октябре, но в настроении казаков уже отсутствовала та уверенность, которая окрыляла их весной, во время победоносного движения к северным границам области. Большинство фронтовиков понимало, что успех этот — временный и что продержаться дольше зимы им не удастся.
            Вскоре обстановка на Южном фронте резко изменилась. Поражение Добровольческой армии в генеральном сражении на орловско-кромском направлении и блестящие действия буденновской конницы на воронежском участке решили исход борьбы: в ноябре Добровольческая армия покатилась на юг, обнажая левый фланг Донской армии,  увлекая и ее в своем отступлении.
            Среди беженцев шли разговоры, что на Кубани растет возмущение, вызванное зверской расправой генерала Деникина над членами Кубанской Рады. Говорили, что Кубань готовит восстание против Добровольческой армии и что будто бы уже ведутся переговоры с представителями Красной Армии о беспрепятственном пропуске советских войск на Кавказ.</p>
            <h3>Кн. 4., Часть 7., Гл. XXVII</h3>
            <p>В Новороссийске шла эвакуация. Пароходы увозили в Турцию российских толстосумов, помещиков, семьи генералов и влиятельных политических деятелей. На пристанях день и ночь шла погрузка. Юнкера работали в артелях грузчиков, заваливая трюмы пароходов военным имуществом, чемоданами и ящиками сиятельных беженцев.</p>
        </div>
    </div>
</section>
`

var y1917_html = `
<section class="map_section" id='main_map'>
      <h2> Карта событий</h2>
      <div class="interactive_map">
        <div class="map_img" id="map1917"><object class="arrows_svg" id="arrows_svg_1917" data="./assets/img/test_year_map.svg" type="image/svg+xml"></object></div>
        <div class="map_years_box">
          <!-- <a class="interactive_map_year_button_active" id='main_1917'>1917</a> -->
          <a class="interactive_map_year_button" id='main_1918'>1918</a>
          <a class="interactive_map_year_button" id='main_1919'>1919</a>
          <a class="interactive_map_year_button" id='main_1920'>1920</a>
        </div>
      </div>
</section>
`

var y1918_html = `
<section class="map_section" id='main_map'>
      <h2> Карта событий</h2>
      <div class="interactive_map">
        <div class="map_img" id="map1918"></div>
        <div class="map_years_box">
          <!-- <a class="interactive_map_year_button" id='main_1917'>1917</a> -->
          <a class="interactive_map_year_button_active" id='main_1918'>1918</a>
          <a class="interactive_map_year_button" id='main_1919'>1919</a>
          <a class="interactive_map_year_button" id='main_1920'>1920</a>
        </div>
      </div>
</section>
`

var y1919_html = `
<section class="map_section" id='main_map'>
      <h2> Карта событий</h2>
      <div class="interactive_map">
        <div class="map_img" id="map1919"></div>
        <div class="map_years_box">
          <!-- <a class="interactive_map_year_button" id='main_1917'>1917</a> -->
          <a class="interactive_map_year_button" id='main_1918'>1918</a>
          <a class="interactive_map_year_button_active" id='main_1919'>1919</a>
          <a class="interactive_map_year_button" id='main_1920'>1920</a>
        </div>
      </div>
</section>
`

var y1920_html = `
<section class="map_section" id='main_map'>
      <h2> Карта событий</h2>
      <div class="interactive_map">
        <div class="map_img" id="map1920"></div>
        <div class="map_years_box">
          <!-- <a class="interactive_map_year_button" id='main_1917'>1917</a> -->
          <a class="interactive_map_year_button" id='main_1918'>1918</a>
          <a class="interactive_map_year_button" id='main_1919'>1919</a>
          <a class="interactive_map_year_button_active" id='main_1920'>1920</a>
        </div>
      </div>
</section>
`

var cur_year = y1918_html;

function hasClass(elem, className) {
    return elem.classList.contains(className);
}

function hasId(element) {
    res = typeof element.id != 'undefined';
    console.log(res);
    return res;
}


function load_info() {
    document.getElementById("wr").innerHTML = start_block_html + info_html;
    document.getElementById("scrool_to").scrollIntoView();
    button = document.getElementsByClassName("header_button_active")[0]
    button.classList.add("header_button")
    button.classList.remove("header_button_active")
    f_button = document.getElementById("info")
    f_button.classList.add("header_button_active")
    f_button.classList.remove("header_button")
};

function load_actions() {
    document.getElementById("wr").innerHTML = start_block_html + actions_html;
    document.getElementById("scrool_to").scrollIntoView();
    button = document.getElementsByClassName("header_button_active")[0]
    button.classList.add("header_button")
    button.classList.remove("header_button_active")
    f_button = document.getElementById("actions")
    f_button.classList.add("header_button_active")
    f_button.classList.remove("header_button")
};

function load_generals() {
    document.getElementById("wr").innerHTML = start_block_html + generals_html;
    document.getElementById("scrool_to").scrollIntoView();
    button = document.getElementsByClassName("header_button_active")[0]
    button.classList.add("header_button")
    button.classList.remove("header_button_active")
    f_button = document.getElementById("generals")
    f_button.classList.add("header_button_active")
    f_button.classList.remove("header_button")
};

function load_main() {
    old_c = document.getElementById("wr");
    new_c = document.createElement("div");
    new_c.classList.add('wrapper');
    new_c.id = 'wr';
    new_c.innerHTML = start_block_html + cur_year + main_html;
    document.getElementById("main_body").replaceChild(new_c, old_c);
    document.getElementById("scrool_to").scrollIntoView();
    button = document.getElementsByClassName("header_button_active")[0];
    button.classList.add("header_button");
    button.classList.remove("header_button_active");
    f_button = document.getElementById("home");
    f_button.classList.add("header_button_active");
    f_button.classList.remove("header_button");
    // setup_svg_listener();
};



function load_map(element, year) {
    let old_active = document.getElementsByClassName("interactive_map_year_button_active")[0];
    old_active.classList.add("interactive_map_year_button");
    old_active.classList.remove("interactive_map_year_button_active")
    element.classList.add("interactive_map_year_button_active");
    element.classList.remove("interactive_map_year_button");
    cur_year = year;
    $('#wr').html(start_block_html + cur_year + main_html);
    document.getElementById("scrool_to").scrollIntoView();
    // setup_svg_listener();
};


// buttons listener

document.addEventListener('click', function (e) {
    // nav buttons
    if (e.target.id == 'info') {
        console.log('clicked btn with id info')
        load_info();
    } else if (e.target.id == 'home') {
        load_main();
    } else if (e.target.id == 'actions') {
        load_actions();
    } else if (e.target.id == 'generals') {
        load_generals();
    }
    // section href buttons
    else if (e.target.id == 'actions_href') {
        load_actions();
    } else if (e.target.id == 'generals_href') {
        load_generals();
    //}
    // map year buttons
    //else if (e.target.id == 'main_1917') {
    //    load_map(e.target, y1917_html);
    } else if (e.target.id == 'main_1918') {
        load_map(e.target, y1918_html);
    } else if (e.target.id == 'main_1919') {
        load_map(e.target, y1919_html);
    } else if (e.target.id == 'main_1920') {
        load_map(e.target, y1920_html);
    }
    // map_arrows
    else if (e.target.id == 'arrows_svg_1917') {
        alert('arr')
    }
}, false);

/*document.addEventListener('mouseenter', function(e) {
    if (e.target.id == "arrow_1917_1"){
        alert(1)
        var svg = document.getElementById("arrows_svg_1917");
        var svgDoc = svg.contentDocument;
        var arrow = svgDoc.getElementById("arrow_1917_1");
        var color = arrow.style.fill
    }
}, false);*/

// setup_svg_listener();

function restart_script(){
    var div = this.parent.document.querySelector('#script_div');
    var script = div.querySelector('#buttons_script');
    console.log(div, script)
    div.removeChild(script);
    div.innerHTML += "<script id='buttons_script' src='assets/js/buttons.js'></script>"
};

function setup_svg_listener(){
        

        //alert("Document loaded, including graphics and embedded documents (like SVG)");
        var a1917 = document.querySelector('#arrows_svg_1917') //document.getElementById("arrows_svg_1917");
        console.log(a1917.contentDocument, a1917.contentWindow)
        var a1918 = document.getElementById("arrows_svg_1918");
        var a1919 = document.getElementById("arrows_svg_1919");
        var a1920 = document.getElementById("arrows_svg_1920");
    
        //get the inner DOM of alpha.svg
        try {
            var svgDoc = a1917.contentDocument;
            var ar1917_1 = svgDoc.getElementById("arrow_1917_1");
            var c1917_1 = ar1917_1.style.fill
            var ar1917_2 = svgDoc.getElementById("arrow_1917_2");
            var c1917_2 = ar1917_2.style.fill
            var ar1917_3 = svgDoc.getElementById("arrow_1917_3");
            var c1917_3 = ar1917_3.style.fill
            ar1917_1.addEventListener("mousedown", function(){arrow_pressed('1917_1')}, false);
            ar1917_1.addEventListener("mouseenter", function(){select_arrow(svgDoc, 'arrow_1917_1_path')}, false);
            ar1917_1.addEventListener("mouseleave", function(){deselect_arrow(svgDoc, 'arrow_1917_1_path', c1917_1)}, false);
            ar1917_2.addEventListener("mousedown", function(){arrow_pressed('1917_2')}, false);
            ar1917_2.addEventListener("mouseenter", function(){select_arrow(svgDoc, 'arrow_1917_2_path')}, false);
            ar1917_2.addEventListener("mouseleave", function(){deselect_arrow(svgDoc, 'arrow_1917_2_path', c1917_2)}, false);
            ar1917_3.addEventListener("mousedown", function(){arrow_pressed('1917_3')}, false);
            ar1917_3.addEventListener("mouseenter", function(){select_arrow(svgDoc, 'arrow_1917_3_path')}, false);
            ar1917_3.addEventListener("mouseleave", function(){deselect_arrow(svgDoc, 'arrow_1917_3_path', c1917_3)}, false);
        } finally {}
};

var select_color = '#00ADB5';

function select_arrow(doc, className) {
    doc.getElementsByClassName(className)[0].style.fill = select_color;
}

function deselect_arrow(doc, className, color) {
    doc.getElementsByClassName(className)[0].style.fill = color;
}

function arrow_pressed(ar_num){
    alert(ar_num + ' pressed');
}
